
import pygame                      # کتابخانهٔ ساخت بازی پای‌گیم را وارد می‌کنیم
pygame.init()                      # همهٔ ماژول‌های لازم پای‌گیم را آماده/راه‌اندازی می‌کند

s = pygame.display.set_mode((400, 300))   # یک پنجرهٔ 400×300 پیکسلی می‌سازد و شیء سطحِ رسم برمی‌گرداند

car = pygame.image.load("car.png").convert_alpha()  # تصویر را از فایل می‌خواند و شفافیت (آلفا) را حفظ می‌کند
r = car.get_rect(center=(200, 150))     # یک مستطیل برای جای تصویر می‌سازد و مرکز آن را وسطِ پنجره می‌گذارد

run = True                               # پرچم اجرای حلقهٔ بازی؛ تا وقتی درست باشد حلقه ادامه دارد
while run:                               # شروع حلقهٔ اصلی بازی/برنامه
    for e in pygame.event.get():         # رویدادهای ورودی (بستن پنجره، کیبورد، ماوس و …) را می‌گیرد
        if e.type == pygame.QUIT: run = False  # اگر کاربر پنجره را ببندد، حلقه متوقف شود

    s.fill((25,187,7))                # پس‌زمینهٔ پنجره را با رنگ سفید پر می‌کند
    s.blit(car, r)                       # تصویر را در مختصات مستطیل r روی سطح s می‌کشد
    pygame.display.flip()                # صفحهٔ نمایش را به‌روزرسانی می‌کند تا تغییرات دیده شوند

pygame.quit()                            # ماژول‌های پای‌گیم را می‌بندد و از برنامه خارج می‌شود
